Repository: it-teaching-abo-akademi/web-services-2017-project-part3-sstepano
Catalog: source/assign4_stepanovic/locale/*/LC_MESSAGES/django.po
Languages: fi, sr

source: Not valid deadline. The minimum duration of an auction is 72 hours from the moment it is created.
fi: Ei voimassaoloaikaa. Huutokaupan vähimmäiskesto on 72 tuntia siitä hetkestä, kun se on luotu.
sr: Krajnji rok nije validan. Minimalno trajanje aukcije je 72 sata od momenta kada je kreirana

source: Not valid minimum price. The minimum price must be positive.
fi: Ei voimassaolevaa vähimmäishintaa. Vähimmäishinnan on oltava positiivinen.
sr: Minimalna cena nije validna. Ona mora biti pozitivna

source: Not valid data
fi: Ei kelvollisia tietoja
sr: Podatak nije validan

source: New auction has been created
fi: Uusi huutokauppa on luotu
sr: Nova aukcija je kreirana

source: Your auction has been created.
fi: Huutokauppa on luotu
sr: Vaša aukcija je kreirana

source: Only the seller can change the description of an auction
fi: Ainoastaan myyjä voi muuttaa huutokaupan kuvausta
sr: Samo prodavac može promeniti deskripciju aukcije

source: Invalid auction id
fi: Virheellinen huutokauppa-tunnus
sr: ID aukcije nije validan

source: New User is created. Please Login
fi: Uusi käyttäjä on luotu. Kirjaudu sisään, ole hyvä
sr: Novi korisnik je kreiran. Molimo vas da se ulogujete

source: Your account was changed. Please Login.
fi: Tilisi muutettiin. Kirjaudu sisään, ole hyvä.
sr: Vaš nalog je promenjen. Molimo vas da se ulogujete

source: Your new account information is not valid. Please, try again.
fi: Uudet tilitietosi eivät ole voimassa. Yritä uudelleen.
sr: Vaš novi nalog nije validan. Molimo vas, pokušajte ponovo

source: Please, try again.
fi: Yritä uudelleen.
sr: Molimo vas, pokušajte ponovo

source: The seller has been changed the description of the auction. Please, try latter.
fi: Myyjää on muutettu huutokaupan kuvaukseksi. Ole hyvä, kokeile jälkimmäistä.
sr: Prodavac menja opis aukcije. Molimo vas, pokušajte ponovo

source: The seller cannot bid on an auction
fi: Myyjä ei voi tarjota huutokauppaa
sr: Prodavac ne može da licitira na aukciji

source: Invalid auction id!
fi: Virheellinen huutokauppa-tunnus
sr: ID nije validan

source: Session expired!
fi: Istunto päättyi!
sr: Sesija je istekla

source: Invalid value!
fi: Kelpaamaton arvo!
sr: Vrednost nije validna

source: Invalid user id!
fi: Virheellinen käyttäjätunnus!
sr: Korisnički ID nije validan

source: A new bid should be greater than the maximum bid
fi: Uuden hintatarjouksen tulisi ylittää enimmäishintatarjous
sr: Nova licitacija bi trebalo da bude veća od maksimalne ponude

source: The another user has been bidded on the auction. Please, try latter.
fi: Toinen käyttäjä on huutokaupassa. Ole hyvä, kokeile jälkimmäistä.
sr: Drugi korisnik licitira na aukciji. Molimo vas, pokušajte ponovo

source: The new bid executed
fi: Uusi tarjous toteutettiin
sr: Nova licitacija je izvršena

source: New bid on the auction has been registered
fi: Uusi tarjous huutokaupassa on rekisteröity
sr: Nova licitacija na aukciji je registrovana

source: Hi
fi: Hei
sr: Zdravo

source: The auction has been banned
fi: Huutokauppa on kielletty
sr: Aukcija je zabranjena

source: Welcome to my site.
fi: Tervetuloa kotisivuilleni
sr: Dobrodošli na moj sajt

source: Seller
fi: Myyjä
sr: Prodavac

source: Description
fi: Kuvaus
sr: Opis

source: Deadline
fi: Takaraja
sr: Krajnji rok

source: Auction Site
fi: Huutokauppapaikka
sr: Aukcijski sajt

source: Edit your user account
fi: Muokkaa käyttäjätiliäsi
sr: Promenite Vaš nalog

source: Logout
fi: Kirjautua ulos

source: Login
fi: Kirjaudu sisään

source: Go
fi: Mennä
sr: Kreni

source: Search
fi: Hae
sr: Traži

source: Change
fi: Muuttaa
sr: Promeni

source: Home
fi: Koti
sr: Početna

source: Bid on the auction
fi: Tarjous huutokaupassa
sr: Licitiraj na aukciju

source: Please click on the link to see your auction
fi: Napsauta linkkiä nähdäksesi huutokaupan

source: Create Auction
fi: Luo huutokauppa
sr: Kreiraj aukciju

source: Edit auction descrription
fi: Muokkaa huutokauppaa
sr: Promenite opis aukcije

source: Username
fi: Käyttäjätunnus
sr: Korisničko ime

source: Password
fi: Salasana
sr: Lozinka

source: EUR and the minimum price
sr: EUR i minimalne cene

source: has been banned.
sr: je zabranjena

source: has been banned
sr: je zabranjena
